join2123/hello-world/STC15F2K60S2/6.实验六智能电子表/智能电子表.c
////////////////////////////////////////////////////////////////////////////////////////
//设计项目:设计一个基于单片机的智能电子表                                             //
//设 计 人:畅福善                                                                     //
//设计时间:2016.5.30                                                                  //
//设计说明:设计一个智能电子表， 利用中断实现智能电子钟的自动走时设计，并在8个数码管上 //
//		   分别显示走时过程(XX-XX-XX)，即XX时、XX分、XX秒中间采用"-"分开；            //
//         利用四个独立按键完成时、分、秒的初始化设置                       //
//         硬件连接条件:1、单片机P0.0~P0.7依次连接第1~8个LED指示灯                    //
//                      2、4个模拟开关依次连接到P3.4,P3.5,P3.6,P3.7                   //
//                      3、数码管数据连接IC7 锁存控制P2.6                             //
//                      4、数码管数据连接IC6 锁存控制P2.7                             //
////////////////////////////////////////////////////////////////////////////////////////

//#include <AT89X51.H> 
//#include "STC89C52RC.H" 
#include "STC15F2K60S2.H" 
////////函数说明////////
void delay02s(void);		//延时2秒子程序//
void delay10ms(void);		//延时10ms的子程序//
void delay500us(void);		//延时500us的子程序//
void delay50us(void);		//延时50us的子程序//

void int_time0(void);       //t0定时器初始化函数 
void int_time1(void);       //t1定时器初始化函数  
void key_set(void);      //设置按键函数
void display_seg_set_hours_min_s(void);//数码管小时设置显示函数
void display_seg_HC6800(void);      //显示函数
////////初始化函数////////
void alarm_buzzer(void );/////交流蜂鸣器自检
void SEG_init(void);      //数码管初始化函数
void LED_init(void);      //LED初始化函数
void key_init(void);      //按键初始化函数

////////变量说明////////
//led定义
sbit L1=P2^0;//////定义第1个指示灯的名称为L1  还可以直接采用P0_0;因为AT89X51.H内部已做定义,下依次类推
sbit L2=P2^1;//////定义第2个指示灯的名称为L2 
sbit L3=P2^2;//////定义第3个指示灯的名称为L3  
sbit L4=P2^3;//////定义第4个指示灯的名称为L4 
sbit L5=P2^4;//////定义第5个指示灯的名称为L5  
sbit L6=P2^5;//////定义第6个指示灯的名称为L6 
sbit L7=P2^6;//////定义第7个指示灯的名称为L7  
sbit L8=P2^7;//////定义第8个指示灯的名称为L8 
//按键定义
sbit key_1=P3^1;//////定义第1个按键为KEY_1
sbit key_2=P3^0;//////定义第1个按键为KEY_2
sbit key_3=P3^2;//////定义第1个按键为KEY_3
sbit key_4=P3^3;//////定义第1个按键为KEY_4
//锁存器定义
sbit duan_clc=P2^6;//////定义段锁存器(IC7)时钟脉冲
sbit wen_clc=P2^7;//////定义位锁存器(IC6)时钟脉冲
//蜂鸣器定义
sbit FMQ=P1^5;//////定义fmq蜂鸣器单片机驱动口
/////////////////////////////
unsigned  char count;/////////按键计数器

unsigned  char code table[]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71,0x40,0x00};////数码管显示码表
//////////////////////////////0     1    2    3    4    5    6    7    8    9	A    B     C    D    E    F	  				 
unsigned  char shiwei;//10位数据
unsigned  char gewei;//个位数据                            	
unsigned  char SEG_1,SEG_2,SEG_3,SEG_4,SEG_5,SEG_6,SEG_7,SEG_8;//////8个数码管对应显示单元定义
bit flag_baojing;///////定义报警标志

unsigned char jsq_50ms,jsq_1s;///////50ms计数器和1S计数器
unsigned char jsq_1min,jsq_1hours;///////1分计数器和1小时计数器
///////////////一键多功能计数器的设置//////////////
unsigned char jsq_function;///////功能计数器
unsigned char jsq_set_xianshi;///////设置显示计数器
//////////////闹铃时间设置//////////////
unsigned char jsq_naoling_1hours,jsq_naoling_1min,jsq_naoling_1s;///////闹铃时间


void main(void) 			//主程序//
	{   
	/////////初始化区////////////////
	key_init();////////按键初始化
	alarm_buzzer() ;///交流蜂鸣器初始化、自检 
	LED_init();////////指示灯初始化、自检
	SEG_init();////////数码管初始化、自检
	int_time0();/////初始化t0定时器
	int_time1();/////初始化t1定时器
	while(1) 			    //进入循环//以下为无限循环程序区
     	{
//TR0=0;TR1=0; 
////////////////利用中断实验时间与数码管的关系,其中采用中断函数计数//////////////////////////////////////
		key_set();///按键设置函数
		display_seg_HC6800();      //显示函数
		//display_seg_set_hours_min_s();  //调用电子表设置显示函数
		//if(jsq_naoling_1hours==jsq_1hours&&jsq_naoling_1min==jsq_1min){TR1=1;}
        } 

}
///////////////////////////////////////////////////
//函数名称:void key_set(void)
//函数功能:设置按键函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void key_set(void)      //设置按键函数
{

///////////1键多功能/////////////////////////
	if(key_1==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms
	  if(key_1==0)///////按键的确按下
	    {
		TR0=0;
		jsq_function++;///////按键计数器计数
		if(jsq_function>=7){jsq_function=0;}//////控制计数器最大值;16即为16进制;20即为20进制;但最大计数255，因为count定义的是unsigend char
		//while(key_1==0){display_seg_set_hours_min_s();}///////按键等待抬起
		while(key_1==0){display_seg_HC6800();}///////按键等待抬起
		}
	}

///////////功能1/////////////////////////
	if(jsq_function==1)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1hours++;
			if(jsq_1hours==24){jsq_1hours=23;}//////控制小时计数器最大值
			while(key_2==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1hours--;
			if(jsq_1hours==255){jsq_1hours=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
	}
///////////功能2/////////////////////////
	if(jsq_function==2)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1min++;
			if(jsq_1min==60){jsq_1min=59;}//////控制小时计数器最大值
			while(key_2==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1min--;
			if(jsq_1min==255){jsq_1min=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
	}
///////////功能3/////////////////////////
	if(jsq_function==3)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1s++;
			if(jsq_1s==60){jsq_1s=59;}//////控制小时计数器最大值
			while(key_2==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1s--;
			if(jsq_1s==255){jsq_1s=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
    }
///////////功能4//闹铃设置///////////////////////
	if(jsq_function==4)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1hours++;
			if(jsq_naoling_1hours==24){jsq_naoling_1hours=23;}//////控制小时计数器最大值
			while(key_2==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1hours--;
			if(jsq_naoling_1hours==255){jsq_naoling_1hours=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
	}
///////////功能5/////////////////////////
	if(jsq_function==5)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1min++;
			if(jsq_naoling_1min==60){jsq_naoling_1min=59;}//////控制小时计数器最大值
			while(key_2==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1min--;
			if(jsq_naoling_1min==255){jsq_naoling_1min=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
	}
///////////功能3/////////////////////////
	if(jsq_function==6)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1s++;
			if(jsq_naoling_1s==60){jsq_naoling_1s=59;}//////控制小时计数器最大值
			while(key_2==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1s--;
			if(jsq_naoling_1s==255){jsq_naoling_1s=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_HC6800();}///////按键等待抬起
			}
		}
    }
///////////功能结束开表运行/////////////////////////

	if(key_4==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms
	  if(key_4==0)///////按键的确按下
	    {
		TR0=1;///////开表0
		TR1=0;///////停表1
		jsq_function=0;////功能计数器清0
		while(key_4==0){display_seg_HC6800();}///////按键等待抬起
		}
	}

