join2123/hello-world/STC15F2K60S2/6.实验六智能电子表/智能电子表.c
}



///////////////////////////////////////////////////
//函数名称:void delay500us(void)
//函数功能:延时500us秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay500us(void)		//延时10ms的子程序//
  { 		
	unsigned char k; /////局部变量定义
	for(k=248;k>0;k--) ////内层循环
		{
		;
		}
  }  
///////////////////////////////////////////////////
//函数名称:void delay10ms(void)
//函数功能:延时10ms秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay10ms(void)		//延时10ms的子程序//
  { 		
	unsigned char j,k; /////局部变量定义
	for(j=20;j>0;j--)   // 上层循环
		{
		for(k=248;k>0;k--) ////内层循环
			{
			;
			}
		}
  } 
 
///////////////////////////////////////////////////
//函数名称:void delay02s(void)
//函数功能:延时0.2秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay02s(void)		//延时子程序//
{ 		
	unsigned char i,j,k; /////局部变量定义
  	for(i=20;i>0;i--)   //最外层循环
		{
		   for(j=20;j>0;j--)   // 上层循环
			{
			for(k=248;k>0;k--) ////内层循环
			 {
			 ;
			 }
			}
		}
} 
///////////////////////////////////////////////////
//函数名称:void int_time0(void)
//函数功能:定时器t0初始化
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void int_time0(void) 
{
	//设置定时器0工作方式//
	TMOD=0x01;								//定义为定时器0方式1,SFR中TMOD位于不能被8整除的地址,所以要按字节方式赋值//
	//赋值方法1//
//	TH0=(65536-50000)/256;					//赋初值//
//	TL0=(65536-50000)%256;
	//赋值方法2//
	TH0=(65536-100)>>8;					//赋初值//
	TL0=(65536-100);
	//打开中断通道//
	ET0=1;									//开启定时器0溢出中断//
	EA=1;									//开启总的中断开关//

///////50ms计数器和1S计数器初始内容清零///////
jsq_50ms=0;
jsq_1s=0;
///////显示秒计数器内容准备///////

	SEG_7=jsq_1s/10;							//显示秒数的十位//
	SEG_8=jsq_1s%10;							//显示秒数的个位//

///////开表/////
	TR0=1;									//开启定时器0//
}

///////////////////////////////////////////////////
//函数名称:void	interrupt_t0(void)	interrupt	1
//函数功能:t0中断函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void	interrupt_t0(void)	interrupt	1		//定时器0溢出中断//
{
////////////赋初值//////////////////////////////////
	//赋初值方法1//
//	TH0=(65536-50000)/256;					//赋初值//
//	TL0=(65536-50000)%256;
	//赋初值方法2//
	TH0=(65536-100)>>8;					//赋初值//
	TL0=(65536-100);
	jsq_50ms++;											//每到一个中断为50毫秒,jsq_50ms加1//
///////50ms满20次=1秒//////
	if(jsq_50ms==20)									//到来20次中断后,jsq_50ms重新计数//
		{	
		jsq_50ms=0;
		jsq_1s++;										//每来20次中断即为1秒,jsq_1s加1//
///////1s满60次=1分//////
		if(jsq_1s==60)									//每到60秒,则重新计时//
			{	
			jsq_1s=0;
			jsq_1min++;
///////1分满60次=1小时//////
			if(jsq_1min==60)									//每到60分,则重新计时//
				{
				jsq_1min=0;
				jsq_1hours++;
///////1小时满24次清零//////
				if(jsq_1hours==24)									//每到24小时,则重新计时//
					{
				jsq_1hours=0;
					}
				}
			}
	///////显示秒计数器内容准备///////

		SEG_1=jsq_1hours/10;;
		SEG_2=jsq_1hours%10;
		SEG_3=16;
		SEG_4=jsq_1min/10;
		SEG_5=jsq_1min%10;
		SEG_6=16;
		SEG_7=jsq_1s/10;								//显示秒数的十位//
		SEG_8=jsq_1s%10;	
		}
}
///////////////////////////////////////////////////
//函数名称:void display_seg_set_hours_min_s(void)
//函数功能:数码管时、分、秒显示函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display_seg_set_hours_min_s(void)      //小时显示函数
{
////显示测试////
//count=7;
//SEG_1=4;
//SEG_2=3;
//SEG_3=8;
//SEG_4=9;
//SEG_5=7;
//SEG_6=2;
//SEG_7=5;
//SEG_8=6;
////////////////////利用计数器不同时间显示不同内容，完成闪烁显示/////////////////
		jsq_set_xianshi++;
////////////////////调表显示/////////////////
if(jsq_function==1||jsq_function==2||jsq_function==3)
{
		SEG_1=jsq_1hours/10;								//显示时的十位//
		SEG_2=jsq_1hours%10;								//显示时的个位//
		SEG_3=16;
		SEG_4=jsq_1min/10;								//显示分的十位//
		SEG_5=jsq_1min%10;								//显示分的个位//
		SEG_6=16;
		SEG_7=jsq_1s/10;								//显示秒数的十位//
		SEG_8=jsq_1s%10;								//显示秒数的个位//
}
////////////////////闹铃显示///////////////	
if(jsq_function==4||jsq_function==5||jsq_function==6)
{
		SEG_1=jsq_naoling_1hours/10;								//显示时的十位//
		SEG_2=jsq_naoling_1hours%10;								//显示时的个位//
		SEG_3=16;
		SEG_4=jsq_naoling_1min/10;								//显示分的十位//
		SEG_5=jsq_naoling_1min%10;								//显示分的个位//
		SEG_6=16;
		SEG_7=jsq_naoling_1s/10;								//显示秒数的十位//
		SEG_8=jsq_naoling_1s%10;								//显示秒数的个位//
}
		if(jsq_function==1&&jsq_set_xianshi<=100)
			{
			SEG_1=17;SEG_2=17;
			}		
		if(jsq_function==2&&jsq_set_xianshi<=100)
			{
			SEG_4=17;SEG_5=17;
			}
		if(jsq_function==3&&jsq_set_xianshi<=100)
			{
			SEG_7=17;SEG_8=17;
			}
///////////////////////////////////////////////////////////
		if(jsq_function==4&&jsq_set_xianshi<=100)
			{
			SEG_1=17;SEG_2=17;
			}		
		if(jsq_function==5&&jsq_set_xianshi<=100)
			{
			SEG_4=17;SEG_5=17;
			}
		if(jsq_function==6&&jsq_set_xianshi<=100)
			{
			SEG_7=17;SEG_8=17;
			}
		if(jsq_set_xianshi>200){jsq_set_xianshi=0;}
//////////////显示程序/////////////////////////////
/////////1位显示//////////////////////
P0=table[SEG_1];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x01;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存

/////////2位显示//////////////////////
P0=table[SEG_2];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x02;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
/////////3位显示//////////////////////
P0=table[SEG_3];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x04;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
/////////4位显示//////////////////////
P0=table[SEG_4];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x08;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
		///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存

/////////5位显示//////////////////////
P0=table[SEG_5];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x10;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存

/////////6位显示//////////////////////
P0=table[SEG_6];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x20;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
/////////7位显示//////////////////////
P0=table[SEG_7];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x40;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
/////////8位显示//////////////////////
P0=table[SEG_8];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x80;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
		///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
}
///////////////////////////////////////////////////
//函数名称:void display_seg_HC6800(void)
//函数功能:HC6800开发板的数码管显示函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display_seg_HC6800(void)      //显示函数
{
////显示测试////
//count=7;
/*
SEG_1=1;
SEG_2=2;
SEG_3=3;
SEG_4=4;
SEG_5=5;
SEG_6=6;
SEG_7=7;
SEG_8=8;
*/
////////////////////利用计数器不同时间显示不同内容，完成闪烁显示/////////////////
		jsq_set_xianshi++;
////////////////////调表显示/////////////////
if(jsq_function==1||jsq_function==2||jsq_function==3)
{
		SEG_1=jsq_1hours/10;								//显示时的十位//
		SEG_2=jsq_1hours%10;								//显示时的个位//
		SEG_3=16;
		SEG_4=jsq_1min/10;								//显示分的十位//
		SEG_5=jsq_1min%10;								//显示分的个位//
		SEG_6=16;
		SEG_7=jsq_1s/10;								//显示秒数的十位//
		SEG_8=jsq_1s%10;								//显示秒数的个位//
}
////////////////////闹铃显示///////////////	
if(jsq_function==4||jsq_function==5||jsq_function==6)
{
		SEG_1=jsq_naoling_1hours/10;								//显示时的十位//
		SEG_2=jsq_naoling_1hours%10;								//显示时的个位//
		SEG_3=16;
		SEG_4=jsq_naoling_1min/10;								//显示分的十位//
		SEG_5=jsq_naoling_1min%10;								//显示分的个位//
		SEG_6=16;
		SEG_7=jsq_naoling_1s/10;								//显示秒数的十位//
		SEG_8=jsq_naoling_1s%10;								//显示秒数的个位//
}
		if(jsq_function==1&&jsq_set_xianshi<=100)
			{
			SEG_1=17;SEG_2=17;
			}		
		if(jsq_function==2&&jsq_set_xianshi<=100)
			{
			SEG_4=17;SEG_5=17;
			}
		if(jsq_function==3&&jsq_set_xianshi<=100)
			{
			SEG_7=17;SEG_8=17;
			}
///////////////////////////////////////////////////////////
		if(jsq_function==4&&jsq_set_xianshi<=100)
			{
			SEG_1=17;SEG_2=17;
			}		
		if(jsq_function==5&&jsq_set_xianshi<=100)
			{
			SEG_4=17;SEG_5=17;
			}
		if(jsq_function==6&&jsq_set_xianshi<=100)
			{
			SEG_7=17;SEG_8=17;
			}
		if(jsq_set_xianshi>200){jsq_set_xianshi=0;}
//////////////显示程序/////////////////////////////
/////////1位显示//////////////////////
P0=table[SEG_1];//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=1;P24=1;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0X00;//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=1;P24=1;///U4位选Y1

/////////2位显示//////////////////////
P0=table[SEG_2];//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=1;P24=1;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0X00;//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=1;P24=1;///U4位选Y1
	///去鬼影//

/////////3位显示//////////////////////
P0=table[SEG_3];//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=0;P24=1;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=0;P24=1;///U4位选Y1

