join2123/hello-world/STC15F2K60S2/6.实验六智能电子表/智能电子表.c
/////////4位显示//////////////////////
P0=table[SEG_4];//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=0;P24=1;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=0;P24=1;///U4位选Y1

/////////5位显示//////////////////////
P0=table[SEG_5];//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=1;P24=0;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=1;P24=0;///U4位选Y1

/////////6位显示//////////////////////
P0=table[SEG_6];//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=1;P24=0;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=1;P24=0;///U4位选Y1

/////////7位显示//////////////////////
P0=table[SEG_7];//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=0;P24=0;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=0;P24=0;///U4位选Y1

/////////8位显示//////////////////////
P0=table[SEG_8];//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=0;P24=0;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0X00;//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=0;P24=0;///U4位选Y1

}
///////////////////////////////////////////////////
//函数名称:void key_init(void)
//函数功能:按键初始化函数
//入口参数:
//出口参数:
//函数说明:P3口是准双向口所以准备读取按键（按键输入）前要向P3口写“1”关闭P3口接地的场效应
///////////////////////////////////////////////////
void key_init(void)      //按键初始化函数
  {
  P3=0xff;/////初始化P3口准备读取按键（按键输入）
  }
///////////////////////////////////////////////////
//函数名称:void LED_init(void)
//函数功能:LED初始化、自检函数
//入口参数:
//出口参数:
//函数说明:采用全部显示的方法解决初始化问题
///////////////////////////////////////////////////
void LED_init(void)      //LED初始化函数
  { 
//////////////多次闪烁显示程序/////////////////////////////
	unsigned char i; /////局部变量定义
  	for(i=3;i>0;i--)   //循环闪烁
	 {
		L1=0;L2=0;L3=0;L4=0;L5=0;L6=0;L7=0;L8=0;
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		L1=1;L2=1;L3=1;L4=1;L5=1;L6=1;L7=1;L8=1;
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
	 }
  }
///////////////////////////////////////////////////
//函数名称:void SEG_init(void)
//函数功能:数码管初始化、自检函数
//入口参数:
//出口参数:
//函数说明:采用全部显示的方法解决初始化问题
///////////////////////////////////////////////////
void SEG_init(void)      //数码管初始化函数
  {
//////////////持续显示程序/////////////////////////////
	unsigned char i; /////局部变量定义
	unsigned char j; /////局部变量定义
  	for(i=9;i>0;i--)   //最外层循环
		{

			SEG_1=i,SEG_2=i,SEG_3=i,SEG_4=i,SEG_5=i,SEG_6=i,SEG_7=i,SEG_8=i;
  	for(j=40;j>0;j--)   //最外层循环
		{

//display_seg_HC6800();      //显示函数
/////////1位显示//////////////////////
P0=table[SEG_1];//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=0;P24=0;///U4位选Y1
delay10ms();

	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=0;P24=0;///U4位选Y1

/////////2位显示//////////////////////
P0=table[SEG_2];//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=0;P24=1;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=0;P24=1;///U4位选Y1
	///去鬼影//

/////////3位显示//////////////////////
P0=table[SEG_3];//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=1;P24=0;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=1;P24=0;///U4位选Y1

/////////4位显示//////////////////////
P0=table[SEG_4];//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=1;P24=1;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=0;P23=1;P24=1;///U4位选Y1

/////////5位显示//////////////////////
P0=table[SEG_5];//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=0;P24=0;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=0;P24=0;///U4位选Y1

/////////6位显示//////////////////////
P0=table[SEG_6];//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=0;P24=1;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=0;P24=1;///U4位选Y1

/////////7位显示//////////////////////
P0=table[SEG_7];//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=1;P24=0;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=1;P24=0;///U4位选Y1

/////////8位显示//////////////////////
P0=table[SEG_8];//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=1;P24=1;///U4位选Y1
delay10ms();
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
P22=1;P23=1;P24=1;///U4位选Y1

		}
}
		SEG_1=0,SEG_2=16,SEG_3=16,SEG_4=16,SEG_5=16,SEG_6=16,SEG_7=16,SEG_8=16;//单个显示0，说明数码管准备完成

}

///////////////////////////////////////////////////
//函数名称:void alarm_buzzer(void)
//函数功能:交流蜂鸣器自检程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void alarm_buzzer(void)		//交流蜂鸣器自检程序//
  { 		
	//unsigned char k; /////局部变量定义
	unsigned int k; /////局部变量定义
	//for(k=248;k>0;k--) ////内层循环
	for(k=4096;k>0;k--) ////内层循环
		{
		FMQ=1;
		delay500us();
		FMQ=0;
		delay500us();
		}
  }  
///////////////////////////////////////////////////
//函数名称:void delay50us(void)
//函数功能:延时50us秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay50us(void)		//延时50us的子程序//
  { 		
	unsigned int k; /////局部变量定义
	for(k=50;k>0;k--) ////内层循环
		{
		;
		}

  }  
///////////////////////////////////////////////////
//函数名称:void int_time1(void)
//函数功能:定时器t1初始化
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void int_time1(void) 
{
//	TMOD=0x01;			//定义为定时器0方式1,SFR中TMOD位于不能被8整除的地址,所以要按字节方式赋值//
//////////t1设置/////////////////////////////////////////
	TH1=(65536-5000)/256;					//赋初值//
	TL1=(65536-5000)%256;
	ET1=1;									//开启定时器1溢出中断//
//	EA=1;
//	TR1=1;								//开启定时器1//
}
///////////////////////////////////////////////////
//函数名称:void	interrupt_t1(void)	interrupt	3
//函数功能:t1中断函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void	interrupt_t1(void)	interrupt	3		//定时器1溢出中断//
{
	TH1=(65536-5000)/256;					//赋初值//
	TL1=(65536-5000)%256;

FMQ=!FMQ;

}

